Measure_samples.org
#+OPTIONS: ':nil *:t -:t ::t <:t H:8 \n:nil ^:nil arch:headline
#+OPTIONS: author:t broken-links:mark c:nil creator:nil
#+OPTIONS: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+OPTIONS: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+OPTIONS: timestamp:t title:t toc:t todo:t |:t
#+TITLE: Measure_samples
#+DATE: <2017-01-03 Tue>
#+AUTHOR:
#+EMAIL: joaquin@joaquin_laptop
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+CREATOR: Emacs 25.1.1 (Org mode 9.0.3)

#+LATEX_CLASS: book
#+LATEX_CLASS_OPTIONS:
#+LATEX_HEADER:
#+LATEX_HEADER_EXTRA:
#+DESCRIPTION:
#+KEYWORDS:
#+SUBTITLE:
#+LATEX_COMPILER: pdflatex

#+OPTIONS: html-link-use-abs-url:nil html-postamble:auto
#+OPTIONS: html-preamble:t html-scripts:t html-style:t
#+OPTIONS: html5-fancy:nil tex:t
#+HTML_DOCTYPE: xhtml-strict
#+HTML_CONTAINER: div
#+DESCRIPTION:
#+KEYWORDS:
#+HTML_LINK_HOME:
#+HTML_LINK_UP:
#+HTML_MATHJAX:
#+HTML_HEAD:
#+HTML_HEAD_EXTRA:
#+SUBTITLE:
#+INFOJS_OPT:
#+CREATOR: <a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 9.0.3)
#+LATEX_HEADER:


* Introduction
This file is a try to document and enhance the program in python to measure the samples through the mechanism of of break-junction in gold samples for the study of molecular properties.
The reason for this is that the current program, while functional is under-documented and the full how-to is preserved through *oral tradition* which is regrettable for an investigation lab, and since the author of this document has a bit of experience in software development and documentation, this file was born.

** Break Junction
The experiment is to measure the break junction

** Actuators and measuremnts
The program uses 2 different mechanical actuators to perform the measurements, and there are 2 different kind of samples to be measured. Finally the measurement is performed by analyzing the conductance of the sample.

*** Mechanical actuators
Since the experiment is based on a single gold "nano-wire"  which is broken through mechanical means, there is need for mechanical acutators to beak the "wire" to measure the conductance change.

**** Faulhaber Motor
The Faulhaber motor is used to perform relatively large movements on the sample and is used to break the sample initially

**** Piezo actuator
Once the junction is broken, the motor is turned off and the piezo-device is used, since it provides a simple controllable way to perform even samller movements on the piece for the study

*** Samples types
Even though the experiment is always performed over gold "wires", there are 2 distinct clasification of the samples.
# So far it seems (to me) that regardless of the type of measurement the mechanism is the same
**** Clean gold
Since the gold is the sustrate, is measured to ensure that is clean and there are no impurities prior to a real measurement

**** Gold + Molecule
The focus of the experiment is to measure the transport (conductance) properties of a given molecule, thus once a gold sustrate has been measured and confirmed to be usable, a molecule solution is placed on the sustrate with the expectation that a molecule gets inserted in the gap between the gold terminals.

*** ADWin measurement
The measurement of the conductance is performed using the ADWin board which has an interface and binding to python. The documentation for the ADWin measurement instrument can be found on the [[http://www.adwin.de/us/download/linux.html][Download page]]

Since the objective is to measure the transport properties, the most important parameters to measure are the conductance and the separation between the gold contacts (break junction)

* Program Description
  :PROPERTIES:
  :header-args+: :comments no
  :END:


As it was already stated the measurement is splitted in 2 steps, the motor initialization and the piezo measurement, however a full program cannot be limited to these 2 steps, as there are additional requirements uch as a user interface for the program. Thus the program is organized as:
- Main loop :: As in many programs the main loop is the one that orchestrates the execution of the program. For details see [[Main Loop]]
- UI Interface :: Considering the requiremens for different configurations for the measurement such as the voltage applied to the juncture, there is a requierement for a reasonable to use UI, and this UI should allow the user to run a measurement. For details see [[User Interface]]
- motor break :: Using the motor actuator, a break juncture is created and then the displacement is set so that a movement generated with the piezo-electric actuator the juncture can be easily reconstructed. For details see [[Motor break junction]]
- Measurement with the piezo :: With the sample in the optimal setting for the piezo is the measured by modifying the voltage applied to the piezo-electric device which in turn creates a displacement of the sample recreating the juncture an allowing for easily repetable measurements through the dynamic range of the piezo-electric device. For details see [[Measurement with Piezo]]

Obviously there is a series of additional modules which provide the interface to the different actuators, and additional helpeer functions to improve the presentation of the results, all of which will be presented in turn.

** DONE Main Loop
   :PROPERTIES:
   :header-args+:  :tangle   main.py
   :END:
#+BEGIN_SRC python :exports none
  """ Module Main - Main file for measuring break-junction experiments

      This is the main file for the program used to
      measure samples using the break-junction technique.
      This program provides a GUI to control the execution
      based on providing the tools to configure a run.
      The program automates the whole procedure by:
      1- Automating the creation of the break junction
         using the motor
      2- Automating the measurement process using a piezo
         actuator.
  """
  __author__ = "Joaquin Figueroa"

#+END_SRC
As with many considerable programs this one stars importing the necesary files. In this case, all the modules imported for the main file come from the modules created for the program.
#+BEGIN_SRC python
  import sys
  from modules.ui_gui import run_gui, UI_CMD
  from modules.motor_break import *
  from modules.piezo_measure import *

#+END_SRC

The main loop is indeed a loop. It is intended to work in the following way.
- First the UI is presented to the user, so the user can modify the configuration of the experiment. As a result from the UI execution there are 3 possible outcomes:
  1. Exit the program
     #+BEGIN_SRC python
       ############################################################
       ## @fn    : main_exit
       #  @brief : Terminates program execution
       ############################################################
       def main_exit(config):
           print("Program Finished successfully")
           sys.exit()
     #+END_SRC
  2. Excecute only the junction creation. This is to prepare a clean sample, since there is no benefit to measure using the piezo a clean sample
     #+BEGIN_SRC python
       ############################################################
       ## @fn      : main_motor_break
       #  @details : Commands the motor to break the gold channel
       #             creating a break-junction and then joins it
       #             again leaving it ready for measurement
       ############################################################
       def main_motor_break(config):
           motor_break_juncture()
     #+END_SRC
  3. Execute a full measurement, creating the juncture and then measure the molecule
     #+BEGIN_SRC python
       ############################################################
       ## @fn      : main_measure
       #  @details : Measures the transport properties of the
       #             sample by creating the break-junction with the
       #             motor, and using the piezo to measure
       ############################################################
       def main_measure(config):
           motor_break_juncture()
           measure_sample()
     #+END_SRC

The outcome picked by the user must be translated into a command in the program, this is performed in a similar way as a switch-case, but in python is implemented as a dictionary test, which may seem odd for someone not used to the technique. For reference please see [[http://www.pydanny.com/why-doesnt-python-have-switch-case.html][switch-case in python.]]
#+BEGIN_SRC python
  ############################################################
  ## @fn      : execute_ui_cmd
  #  @details : Analyzed the command chosen by the user and
  #             executes it. Options are:
  #             1- End program
  #             2- only perform break-junction
  #             3- perform full measurement of the sample
  ############################################################
  def execute_ui_cmd(ui_cmd, config):
      switch = {
          UI_CMD.EXIT    : main_exit,
          UI_CMD.M_BREAK : main_motor_break,
          UI_CMD.MEASURE : main_measure,
      }
      cmd = switch.get(ui_cmd, sys.exit)
      cmd(config)
#+END_SRC

Finally the main loop is executed indefinitely until the user terminates the program

#+BEGIN_SRC python
  ############################################################
  ## @details : Main loop. Executes UI Cmd until the user end
  ##            the program
  ############################################################
  def main():
      while True:
          ui_config, config = run_gui()
          ui_cmd    = ui_config.cmd
          execute_ui_cmd(ui_cmd, config)

  if __name__ == "__main__":
      main()
#+END_SRC

** TODO User Interface
   :PROPERTIES:
   :header-args+:  :noweb    tangle
   :END:
The user interface has 2 requirements.
1. It should allow the user to run the experiment
2. It should allow the user to tweak with the configuration for the experiment

Now there is an additional requirement for the UI, which is the interface by itself, is related to the configuration, and the different measurement process available. Up to this point we have 3 main purposes:
1. Histogram measurement of the conductance/distance characteristic of the molecule
2. Display the measurements, which is used during measurements as feedback for the process and allows an advance user to judge the state of the experiment
3. intermediate measurements which are measurements of the I/V characteristics of the sample and are used in the experiment to drive the program to the starting point as it was discussed in [[Program Description]].

With this into consideration I have decided to provide with 2 distinct interfaces for the program:
- Configuration files :: Configuration files are the standard direct way of configuring the behavior of a program, and if done properly is easier to extend and adapt.
- GUI :: A graphical user interface will be provided for user that may not have an interest in tweaking with the configuration files, the purpose of the GUI is to automatically  generate the corresponding configuration files through a relatively more intuitive interface. Considering that GUI programming is harder, it may be possible that another programmer may find the task of extending the GUI to daunting, which is the reason for this dual approach instead of simply using a GUI directly.

Now I will provide a slightly more detailed view of the UI directives, leaving in depth description to the corresponding sections.

As previously discussed, there are several parameters to tweak, which can be modified with a configuration file that is written in use [[http://www.yaml.org][YAML]], for its simplicity for the user, and corresponding library availability for python which allows for simple interfaces for readers and writers of the configuration file.

The configuration file will be read and used to create a *configuration structure* (See [[Program Configuration-Process configurations]] ), which has the configurations for each of the configurable processes in a *Sub-configuration* manner.

For each configurable process, we easily identify 2 types of parameters:
- Configurable parameters :: These are the parameters that are modified through the Configuration file. Even though the user may modify these values, the parameters can't be set to any arbitrary value, therefore there is a mechanism to ensure that the values may never exceed some hardcoded limits. See  [[Parameters definitions]]
- Non Configurable parameters :: This are parameters, that are needed for running the different processes, but should not be tampered by the user, and therefore are hard-coded in the program.

On the other hand, it was mentioned that the GUI will build a configuration file for use of the rest of the program, therefore a Writer function is needed for a configuration, so the *YAML* can be written. Naturally the easiest way to achieve such functionality is to tie it directly to the same configuration, therefore the GUI would be building a configuration in order to write the configuration file. At first glance this may seem redundant, but allows for planning of multiple builds or even ensuring the exact parameters of a particular run of the experiment, as the written file will be available for further inspection.

Considering the previous description, the User interface of the program can be separated in the following logical sections.

- Configuration :: As mentioned the configuration is the main objective of the configuration file and should be considered as a 2 part section. Further details can be seen in the [[Program Configuration]]
  - Configuration file :: Which is the definition of the configuration file, and therefore defines the configurable parameters
  - Configuration Class :: Which is the output of the configuration, and provides the configurations for every configurable process of the program.
- Parameters Definitions :: This section shown in  [[Parameters definitions]] has the necessary definitions to have a robust interface with the user defined variables. It also provides the definitions for the hardcoded constants and their manipulations
- GUI :: The Graphical User interface which will launch a application terminal for the user to tweak the different parameters and finally write a configuration file for further use.
*** TODO Program Configuration
    :PROPERTIES:
    :header-args+: :tangle   modules/configuration.py
    :header-args+: :noweb    tangle
    :END:

The program configuration, is the interface that allows the user to modify the program's behavior through the use of configuration files; the functionality to do this is provided in the file  [[file:modules/parameters.py]]. This file provides:
- Configuration structures :: The configuration structures is a set of classes which are used to configure the different processes of the program. Further explained in [[Program Configuration-Process configurations]]
- Configuration File interface :: Provides with the functions required to interact with the configuration file, which means to read and write it. Also this section provides the specification for the file. Further details in [[Configuration Files]]

# Here we put the header
#+BEGIN_SRC python :exports none
  """ Module configuration - Defines the whole interface to configure the program

             This file defines the different configuration
             structures and interfaces, while also providing
             with the interface for the configuration file parsing
  
             The Main purpose of this file is to generate the
             necesary configurations for the different processes
             performed by the program
  """
  __author___ = "Joaquin Figueroa"

  import yaml
  import adwin_driver as adwin
  import parameters as param
#+END_SRC

