Measure_samples.org
**** TODO Program Configuration-Process configurations
This section is devoted to describe the configuration of the program, which is tied to the configuration file specification shown in [[Configuration Files specification]], but is also tied to the different processes which are used through the program for the different types of measurements that are defined in the [[ADwin Driver]].

In order to provide with the complete interface, the file is separated in:
- Full configuration :: Properly discussed in [[Full Configuration definition]]. This configuration is a large structure whose purpose is to serve a single return parameter of the different types of configuration. It also provides with some generic functionalities
- IV-Measurement Configuration :: Properly defined in [[IV-Measurement Configuration]]. This structures has the parameters required to perform the  IV-measurement as defined in [[Adwin driver-IV measurement class]]
- Histogram Measurements configuration ::  Properly defined in [[Histogram-Measurement Configuration]]. This structures has the parameters required to perform the  histogram measurements as defined in [[Adwin driver-histogram class]]
- Display Configuration :: Properly defined in [[Display Configuration]]. This structure has all the parameters needed to produce runtime graphics to display the results for the user to judge the quality of the results.

***** Full Configuration definition
The full configuration is the general interface for all configuratioins, as it encompasses them all.

#+BEGIN_SRC python
  class program_config(object):
      def __init__(self, data=None):
          iv_data = None
          hist_data = None
          display_data = None
          save_data = None
          if data:
              iv_data = data.get('IV Configuration')
              hist_data = data.get('Histogram Configuration')
              display_data = data.get('Display Configuration')
              save_data = data.get('Save Options')

          self.iv_config = iv_config(iv_data)
          self.hist_config = histogram_config(hist_data)
          self.display_config = display_config(display_data)
          self.save_config = save_options(save_data)
      def dump_config_file(self, filename=None):
          config = {}
          config['IV Configuration'] = self.iv_config.config
          config['Histogram Configuration'] = self.hist_config.config
          config['Display Configuration'] = self.display_config.config
          config['Save Options'] = self.save_config.config
          yaml_dump(filename, config)

#+END_SRC

***** IV-Measurement Configuration
#+BEGIN_SRC python
  class iv_config(object):
      def __init__(self, data=None):
          self.build_config_dflt()
          if data:
              self.update_config_with_data(data)

      def build_config_dflt(self):
          self.measure_jv = param.juncture_voltage()
          self.avg_points = param.avg_points()
          self.use_log_amp = param.use_log_amp()
          self.log_ampl = param.adwin_log_amplifier()
          self.wait = param.GLOBAL_CONSTANTS.IV_settling_time
          self.start_jv = param.GLOBAL_CONSTANTS.start_jv
          self.end_jv = param.GLOBAL_CONSTANTS.end_jv
          self.max_data = param.GLOBAL_CONSTANTS.IV_max_data_points
          self.config = {}
          self.update_config()

      def update_config(self):
          self.config['JunctureVoltage'] = self.measure_jv.get_value()
          self.config['AveragePoints'] = self.avg_points.get_value()
          self.config['UseLogAmplifier'] = self.use_log_amp.get_value()

      def update_config_with_data(self, data):
          self.measure_jv.update_or_dflt(data.get('JunctureVoltage'))
          self.avg_points.update_or_dflt(data.get('AveragePoints'))
          self.use_log_amp.update_or_dflt(data.get('UseLogAmplifier'))
          self.update_config()

      def get_log_array(self):
          return self.log_ampl.get_calibration()
      def get_start_jv(self):
          return adwin.adwin_ADC(self.start_jv)
      def get_measure_jv(self):
          return adwin.adwin_ADC(self.measure_jv.get_value())
      def get_end_jv(self):
          return adwin.adwin_ADC(self.end_jv)
      def get_avg_points(self):
          return self.avg_points.get_value()

      def get_wait_cycles(self):
          return adwin.adwin_convert_ms_to_cycles(self.wait)
      def get_max_data(self):
          return self.max_data
      def get_real_jv(self):
          return adwin.adwin_DAC(self.get_measure_jv())
      def get_use_log_amp(self):
          return self.use_log_amp.get_value()
#+END_SRC

***** Histogram-Measurement Configuration
#+BEGIN_SRC python
  class histogram_config(object):
      def __init__(self, data=None):
          self.build_config_dflt()
          if data:
              self.update_config_with_data(data)

      def build_config_dflt(self):
          self.measure_jv = param.juncture_voltage()
          self.start_jv = param.GLOBAL_CONSTANTS.start_jv
          self.end_jv = param.GLOBAL_CONSTANTS.end_jv
          self.use_log_amp = param.use_log_amp()
          self.log_ampl = param.adwin_log_amplifier()
          self.avg_points = param.avg_points()
          self.break_speed = param.break_speed()
          self.make_speed = param.make_speed()
          self.G0 = param.GLOBAL_CONSTANTS.G0
          self.G_break_end = 1e-5 * self.G0
          self.G_make_end = 20 * self.G0
          self.config = {}
          self.update_config()

      def update_config(self):
          self.config['JunctureVoltage'] = self.measure_jv.get_value()
          self.config['AveragePoints'] = self.avg_points.get_value()
          self.config['BreakSpeed'] = self.break_speed.get_value()
          self.config['MakeSpeed'] = self.make_speed.get_value()
          self.config['UseLogAmplifier'] = self.use_log_amp.get_value()

      def update_config_with_data(self, data):
          self.measure_jv.update_or_dflt(data.get('JunctureVoltage'))
          self.avg_points.update_or_dflt(data.get('AveragePoints'))
          self.break_speed.update_or_dflt(data.get('BreakSpeed'))
          self.make_speed.update_or_dflt(data.get('MakeSpeed'))
          self.use_log_amp.update_or_dflt(data.get('UseLogAmplifier'))
          self.update_config()

      def get_log_array(self):
          return self.log_ampl.get_calibration()
      def get_start_jv(self):
          return adwin.adwin_ADC(self.start_jv)
      def get_measure_jv(self):
          return adwin.adwin_ADC(self.measure_jv.get_value())
      def get_end_jv(self):
          return adwin.adwin_ADC(self.end_jv)
      def get_avg_points(self):
          return self.avg_points.get_value()

      def get_real_jv(self):
          return adwin.adwin_DAC(self.get_measure_jv())
      def get_use_log_amp(self):
          return self.use_log_amp.get_value()
      def get_break_wait(self):
          # We are taking 0->1000 to 0->10, because that's the Adwin range
          break_speed = self.break_speed.get_value()/100 # in V/seg 
          zero_v_steps = adwin.adwin_ADC(0)              # in V/seg (for range)
          break_steps_seg = (adwin.adwin_ADC(break_speed) -zero_v_steps) # in seg
          break_steps_ms = break_steps_seg * 1e-3

          break_wait = 1/break_steps # in ms
          return adwin.adwin_convert_ms_to_cycles(break_wait)
      def get_make_wait(self):
          # We are taking 0->1000 to 0->10, because that's the Adwin range
          make_speed = self.make_speed.get_value()/100
          zero_v_steps = adwin.adwin_ADC(0) 
          make_steps_seg = (adwin.adwin_ADC(make_speed) -zero_v_steps) # in seg
          make_steps_ms = make_steps_seg *1e-3 # in ms

          make_wait = 1/make_steps # in ms
          return adwin.adwin_convert_ms_to_cycles(make_wait)
      def get_I_break_end(self):
          return  self.G_break_end * self.get_real_jv()
      def get_I_make_end(self):
          return  self.G_make_end * self.get_real_jv()

#+END_SRC

***** Display Configuration
#+BEGIN_SRC python
  class display_config(object):
      def __init__(self, data=None):
          self.build_config_dflt()
          if data:
              self.update_config_with_data(data)

      def build_config_dflt(self):
          self.xmin = param.display_xmin()
          self.xmax = param.display_xmax()
          self.Gmin = param.display_Gmin()
          self.Gmax = param.display_Gmax()
          self.nGbins = param.display_nGbins()
          self.nXbins = param.display_nXbins()
          self.traces = param.traces()
          self.config = {}
          self.update_config()


      def update_config(self):
          self.config['xmin'] = self.xmin.get_value()
          self.config['xmax'] = self.xmax.get_value()
          self.config['Gmin'] = self.Gmin.get_value()
          self.config['Gmax'] = self.Gmax.get_value()
          self.config['nGbins'] = self.nGbins.get_value()
          self.config['nDbins'] = self.nXbins.get_value()
          self.config['NumberTraces'] = self.traces.get_value()

      def update_config_with_data(self, data):
          self.xmin.update_or_dflt(data.get('xmin'))
          self.xmax.update_or_dflt(data.get('xmax'))
          self.Gmin.update_or_dflt(data.get('Gmin'))
          self.Gmax.update_or_dflt(data.get('Gmax'))
          self.nGbins.update_or_dflt(data.get('nGbins'))
          self.nXbins.update_or_dflt(data.get('nDbins'))
          self.traces.update_or_dflt(data.get('NumberTraces'))

          self.update_config()

      def get_xmin(self):
          return self.xmin.get_value()
      def get_xmax(self):
          return self.xmax.get_value()
      def get_Gmin(self):
          return self.Gmin.get_value()
      def get_Gmax(self):
          return self.Gmax.get_value()
      def get_nGbins(self):
          return self.nGbins.get_value()
      def get_nXbins(self):
          return self.nXbins.get_value()
      def get_traces(self):
          return self.traces.get_value()
#+END_SRC

***** Save options
#+BEGIN_SRC python
  class save_options(object):
      def __init__(self, data=None):
          self.build_config_dflt()
          if data:
              self.update_config_with_data(data)

      def build_config_dflt(self):
          self.save_dir = param.save_dir()
          self.save_data = param.save_data()
          self.config = {}
          self.update_config()


      def update_config(self):
          self.config['SaveData'] = self.save_data.get_value()
          self.config['SaveDir'] = self.save_dir.get_value()

      def update_config_with_data(self, data):
          self.save_dir.update(data.get('SaveDir'))
          self.save_data.update(data.get('SaveData'))

          self.update_config()

      def get_save_data(self):
          return self.save_data.get_value()
      def get_save_dir(self):
          return self.save_dir.get_value()

#+END_SRC
***** File Interface

 Since the program will be configured through a configuration file, it only makes sense to provide with a writer and a parser for it. Fortunately we already have most of the heavy-lifting done by YAML libraries and the parameters configurations in the UI-interface part of the program, I'd expect this part to be relatively easy to understand.

 #+BEGIN_SRC python
   def yaml_loader(filepath):
       with open(filepath, "r") as file_descriptor:
           data = yaml.safe_load(file_descriptor)
       return data

   def yaml_dump(filepath, data):
       with open(filepath, "w") as file_descriptor:
           yaml.dump(data, file_descriptor, default_flow_style=False)

   def yaml_build_config_from_file(filepath):
       data = yaml_loader(filepath)
       return program_config(data)
#+END_SRC

***** Testing program configuration                                :noexport:
      :PROPERTIES:
      :header-args+: :tangle   no
      :header-args+: :noweb    tangle
      :END:

#+BEGIN_SRC python 
  from modules.configuration import *
  import numpy as np
  infile = "Measurement_deafult_config.yaml"
  outfile = "Measurement_read_config.yaml"
  config = yaml_build_config_from_file(infile)
  config.dump_config_file(outfile)
  Gmax = config.display_config.get_Gmax()
  Gmin = config.display_config.get_Gmin()
  #  return Gmin

  return np.log10(Gmin)
#+END_SRC

#+RESULTS:
: -7.0

**** TODO Configuration File Specification
      :PROPERTIES:
      :header-args+: :tangle  Measurement_deafult_config.yaml
      :END:
Following a more traditional UNIX approach, is a good idea to allow the program to be run from the command line, rather than forcing a GUI to the user. By using a configuration file, the user will be able to configure the run, and be sure that all parameters are correctly set beforehand, in a way that would allow for several runs automatically.

Also the introduction of configuration files does not mean that the program will do away with the GUI, rather that the GUI will generate the appropriate configuration file, to run  the program.

 To specify the configuration, I've decided to use [[http://www.yaml.org][YAML]], which provides a relatively simple interface, and an appropriate parser for python, while also allowing comments.
 The configuration will be split in 3 parts.
 - IV Parameters :: These are variables that control the Adwin during the motor break process.
 - Histogram parameters :: The histogram is the measurement that the program is really interested on, therefore the user may need to modify some parameters
 - Presentation parameters :: During measurement the program will display the histogram to provide the user with feedback, therefore the user may need to modify some of these parameters to better suits his[fn:or her needs] needs

 That being said, we provide with an example configuration file. See [[http://www.yaml.org/spec/1.2/spec.html][YAML Specification]] or [[http://ess.khhq.net/wiki/YAML_Tutorial][YAML tutorial]]
 #+BEGIN_SRC yaml
   # Begin of configuration File
   ---
   IV Configuration :              # Continous measurement during motor break
     JunctureVoltage : 0.1         # Range 0.1-0.3
     AveragePoints : 32            # Number of points to average
     UseLogAmplifier: true

   Histogram Configuration:
     JunctureVoltage : 0.1         # Range 0.1-0.3
     AveragePoints : 32            # Number of points to average
     BreakSpeed : 300              # Volts/s
     MakeSpeed : 500               # Volts/s
     UseLogAmplifier: true

   Display Configuration:
     xmin : -0.5                   # nm
     xmax : 2                      # nm
     Gmin : 1e-7                   # G0
     Gmax : 10                     # G0
     nGbins : 251                  # Slots for Conductance histogram
     nDbins : 161                  # Slots for Distance histogram
     NumberTraces : 5000            # Number of histograms

   Save Options:
     SaveData: Yes
     SaveDir : 'E:/Measurements/Fullerenos/C60 2/Molecule/'
 #+END_SRC
*** TODO Parameters definitions
    :PROPERTIES:
    :header-args+: :tangle   modules/parameters.py
    :header-args+: :noweb    tangle
    :END:

As mentioned earlier, there are 2 basic types of parameters: Configurable, and  Non-Configurable. The non configurable parameters are global constants of the program.
The parameters are located in the file [[file:modules/parameters.py]], which has the minimum requirements for it to work.

# Here we put the header
#+BEGIN_SRC python :exports none
  """ Module parameters - Defines configurable parameters and global constants

             This file defines the configurable parameters of the
             program with their corresponding interfaces and
             validations.
             Also the program provides the definitions of the
             global constants of the program
  """  
  __author__ = "Joaquin Figueroa"

  import os
  import utilities as utl
#+END_SRC

