Measure_samples.org
**** DONE Configurable parameters definitions
     For configurable parameters, is necessary to allow the user to set values within certain limits, either to avoid damaging the equipment, the sample or just to prevent measurement that would take months to complete.
     The proper way to allow users to set the values within a constrained range is to provide with validation code, and if necessary with error correction.
     Considering the configuration file definition shown in [[Configuration Files]], the *data directory* which is further discussed in [[Data directory]] is one of the few parameters that are not a number. It is noticed that all numeric parameters show some similarities and therefore are defined together in [[Numerical Parameters definition]]

     The Parameter that controls if the Data should be saved is defined in [[Histogram Save Data]]

***** DONE Data directory
  The program provides the user with the ability to store the Data in a directory of his choice, which is stored as a string.
  The data directory parameter is defined in [[src-config-data-dir-class]], which provides the full interface for the data directory.

  - Initialization Function :: Defined at [[(src-dd-init)]]. This function uses the "reset" function
  - Reset function :: Defined at [[(src-dd-reset)]], this function restores the default data directory, is chosen to be a "data" subdirectory of the program root directory.
  - Validation Function :: Defined at [[(src-dd-validation)]], this function returns true if the chosen path is a directory as recognyzed by the operative system.
  - Update functionality :: Defined at [[(src-dd-update)]], this function is used to change the data directory to a new chosen path in the computer.
  -  Printing function ::  Defined at [[(src-dd-print)]] and used mainly for debug purposes this function prints the chosen data directory to the console.

  #+CAPTION: Data directory parameter class
  #+NAME: src-config-data-dir-class
  #+BEGIN_SRC python -n -r
    #############################################################
    ## @class   traces
    #  @brief   All functionality related to the data directory
    #
    #  @details This class defines the parameter that controls
    #           where the results will be stored. Is a string
    #           that codifies the directory, depending on the
    #           os and inspect modules
    #############################################################
    class save_dir(object):
        _subdir= "data"#(ref:src-dd-dflt)
        #############################################################
        ## @brief   Initilaization code
        #############################################################
        def __init__(self):#(ref:src-dd-init)
            self.value = None
            self.reset()
        ##############################################################
        ## @brief   restores the default value of the number of traces
        ##############################################################
        def reset(self): #(ref:src-dd-reset)
            script_root = utl.get_script_root_path()
            data_path = os.path.join(script_root, self._subdir)
            self.value = data_path
        ##############################################################
        ## @brief   Ensures the new target string is a directory
        ##############################################################
        def validate(self, new_path):#(ref:src-dd-validation)
            return new_path and os.path.isdir(new_path)
        #############################################################
        ## @brief   Updates the target directory only if its a
        #           directory in the filesystem
        #############################################################
        def update(self, new_path):#(ref:src-dd-update)
            if self.validate(new_path):
                self.value = new_path
        #############################################################
        ## @brief   Returns the value of the parameter
        #############################################################
        def get_value(self): # (ref:src-dd-validation)
            return self.value
        #############################################################
        ## @brief   Print the parameter.
        #############################################################
        def print_param(self):#(ref:src-dd-print)
            print("Data Directory = %s" % self.value)
  #+END_SRC

***** DONE Numerical Parameters definition
  As previously stated most parameters are numerical, so a parent class is created to provide a common interface for them all and to ensure that all numerical parameters behave consistently.
  The numerical parameters are defined in [[src-config-num-param-class]], which provides the interfaces that define the numerical parameters
  - Initialization function :: The function defined in line [[(src-np-init)]], provide the initialization code for a generic numerical parameter, which is defined by the following parameters:
    - Default Value :: Is the value that the parameter takes by default, such as the voltage for the juncture.
    - Minimum value :: The minimum value acceptable for the parameter. With the maximum value defines the range of admissible values
    - Maximum value :: The maximum value acceptable for the parameter. With the minimum value defines the range of admissible values
    - Name :: The name defines a name for the parameter, which is useful to print information about it.
  - Reset function :: Defined in line  [[(src-np-reset)]], provides a mechanism to restore the parameter value to its default.
  - Validation function ::  Defined in line [[(src-np-validation)]] returns a boolean determining if the new value is within the range of accepted values
  - Update function :: Defined in line  [[(src-np-update)]] updates the parameter to a new value defined by the user, only if the value is within the accepted range, but if not it leaves the value unchanged
  - Update or default function :: Defined in line  [[(src-np-update-dflt)]] similar to the update function, this will reset the value to the default if the provided value is invalid; Also provides and optional error message in such case.
  - Print function ::  Defined in line  [[(src-np-print)]] provides an utility to print the current value to the terminal. Useful during testing and for sending messages
  - Error message :: Defined in line  [[(src-np-print)]] Will print and error message if the user tries to set the value of the parameter to an invalid quantity. This error function is intended for use through the configuration file, and is not necessary if the user uses the GUI.


  #+CAPTION: Numerical parameters class definition
  #+NAME: src-config-num-param-class
  #+BEGIN_SRC python  -n -r
    #############################################################
    ## @class   Numerical Parameter
    #  @brief   All functionality related to the numerical
    #           parameters
    #
    #  @details This class defines the basic behavior common to
    #           all numerical parameters, including common
    #           interfaces and values.
    #############################################################
    class numerical_parameter(object):
        #############################################################
        ## @brief   Initilaization code
        #############################################################
        def __init__(self, name, dflt_val, min_val, max_val):#(ref:src-np-init)
            self._dflt = dflt_val
            self._min = min_val
            self._max = max_val
            self.name = name
            self.value = None
            self.reset()
        #############################################################
        ## @brief   restores the default value of the parameter
        #############################################################
        def reset(self): #(ref:src-np-reset)
            self.value = float(self._dflt)
        #############################################################
        ## @brief   Determines if a new value is in the permited
        #           range
        #############################################################
        def validate(self, val):#(ref:src-np-validation)
            val = float(val)
            return (self._min <= val) & (val <= self._max)
        #############################################################
        ## @brief   Updates the stored value only if the new
        #           value is within range
        #############################################################
        def update(self, new_val):#(ref:src-np-update)
            if self.validate(new_val):
                self.value = float(new_val)
        #############################################################
        ## @brief   Updates the stored value only if the new
        #           value is within range, otherwise returns to
        #           the default value
        #############################################################
        def update_or_dflt(self, new_val, verbose=True): #(ref:src-np-update-dflt)
            if self.validate(new_val):
                self.value = float(new_val)
            else:
                self.reset()
                if verbose:
                    self.error_message(new_val)
        #############################################################
        ## @brief   returns the value
        #############################################################
        def get_value(self):        #(ref:src-np-update-dflt)
            return self.value
        #############################################################
        ## @brief   Prints the parameter name and its value
        #############################################################
        def print_param(self):#(ref:src-np-print)
            print("{0} = {1}".format(self.name, self.value))
        #############################################################
        ## @brief   Prints error message if parameter outside range
        #############################################################
        def error_message(self, value):#(ref:src-np-error)
            print("------------------------------------------------")
            print("ERROR INVALID PARAMETER VALUE:")
            print("Value {0} is invalid for parameter {1}".format(self.name, value))
            print("Using default value {0}".format(self._dflt))
            print("Valid range for parameter {0} is:".format(self.name))
            print("Range min ={0}, Max ={1}".format(self._min, self._max))
            print("------------------------------------------------")
  #+END_SRC

  There is also a requirement to treat some numerical parameters as integers, therefore a specialization of the numerical parameters is shown in  [[src-config-int-param-class]], where some modifications and overloading are executed to provide with the desired properties.
  - Values must be integers :: This class must have all its values as integers, thus the default values and other parameters are cast as integers.
  - Validation Function :: Defined in line [[(src-ip-validation)]], this function also confirms that the parameter is an integer
  - Print as integer :: The printing function defined in line  [[(src-ip-print)]], changes the format to ensure that the parameter is displayed as an integer and not as a float. This is a minor change, but desirable for consistency.

  #+CAPTION: Integer parameters class definition
  #+NAME: src-config-int-param-class
  #+BEGIN_SRC python  -n -r
    #############################################################
    ## @class   Integer Parameter
    #  @brief   All functionality related to the numerical
    #           parameters that are to be treated as int
    #############################################################
    class integer_parameter(numerical_parameter):
        #############################################################
        ## @brief   Initilaization code
        #############################################################
        def __init__(self, name, dflt_val, min_val, max_val):
            _dflt = int(dflt_val)
            _min = int(min_val)
            _max = int(max_val)
            self.value = None
            super(integer_parameter, self).__init__(name, _dflt, _min, _max)
        #############################################################
        ## @brief   Determines if a new int value is in the permited
        #           range, and integer
        #############################################################
        def validate(self, val): # (ref:src-ip-validation)
            is_valid = super(integer_parameter, self).validate(val)
            return  val and float(val).is_integer() and is_valid
        #############################################################
        ## @brief   Determines if a new int value is in the permited
        #           range, and integer
        #############################################################
        def update(self, new_val): # (ref:src-ip-validation)
            super(integer_parameter, self).update(new_val)
            self.value = int(self.value)
        #############################################################
        ## @brief   Determines if a new int value is in the permited
        #           range, and integer
        #############################################################
        def get_value(self): # (ref:src-ip-validation)
            return int(super(integer_parameter, self).get_value())
        #############################################################
        ## @brief   Prints the parameter name and its value
        #############################################################
        def print_param(self): # (ref:src-ip-print)
            print("%s = %d" % (self.name, self.value))
  #+END_SRC

****** DONE Numerical Parameter Test                               :noexport:
  Test the functionality of a generic numerical parameter. Just excecuted by using =C-c C-c=. Should all be true
  #+BEGIN_SRC python :tangle no
    import modules.parameters as c
    tp = c.numerical_parameter("Test", 7.8, 0.5, 50)
    t1 = tp.value == 7.8
    t2 = tp.validate(-1.1) == False
    tp.update(0.12)
    t3 = tp.value == 7.8
    tp.update(9)
    t4 = tp.value == 9
    t5 = tp.validate(88) == False
    tp.update(55)
    t6 = tp.value == 9
    tp.update(0.7)
    t7 = tp.value == 0.7
    tp.reset()
    t8 = tp.value == 7.8
    t9 = tp.name == "Test"
    return [t1, t2, t3, t4, t5, t6, t7, t8, t9]
  #+END_SRC

  #+RESULTS:
  | True | True | True | True | True | True | True | True | True |

