Measure_samples.org
****** DONE Average points
   For each histogram measurement, at each voltage value, the instrument should take several consecutive measurements and average them, this parameter defined in [[src-config-avg-points-class]] is just a specialization of the integer parameter class shown in [[src-config-int-param-class]]

   #+CAPTION: Average points class definition
   #+name: src-config-avg-points-class
   #+BEGIN_SRC python -n -r
     #############################################################
     ## @class   avg_points
     #  @brief   All functionality related to the number of average points
     #
     #  @details This class defines the behavior of the jucture
     #           voltage. Provides the default values and range
     #           plus the corresponding interface.
     #############################################################
     class avg_points(integer_parameter):
         #############################################################
         ## @brief   Initilaization code
         #############################################################
         def __init__(self):
             _dflt = 32
             _min = 1
             _max = 99
             _name = "Average Points"
             super(avg_points, self).__init__(_name, _dflt, _min, _max)
   #+END_SRC

****** DONE Juncture Voltage
       The juncture voltage defined in [[src-config-juncture-voltage-class]], as previously stated, is the parameter that controls the voltage applied to the juncture during the analysis. The juncture voltage class is just a specialization of the Numerical parameter class described in [[Numerical Parameters definition]]

   #+CAPTION: Juncture voltage class definition
   #+name: src-config-juncture-voltage-class
   #+BEGIN_SRC python  -n -r
     #############################################################
     ## @class   juncture_voltage
     #  @brief   All functionality related to the juncture voltage
     #
     #  @details This class defines the behavior of the jucture
     #           voltage. Provides the default values and range
     #           plus the corresponding interface.
     #############################################################
     class juncture_voltage(numerical_parameter):
         #############################################################
         ## @brief   Initilaization code
         #############################################################
         def __init__(self):
             _dflt = 0.1
             _min = 0.0
             _max = 0.3
             _name = "Juncture Voltage"
             super(juncture_voltage, self).__init__(_name, _dflt, _min, _max)
   #+END_SRC

******* DONE juncture voltage test                                 :noexport:
   Test functionality. Just excecuted by using =C-c C-c=. Should all be true
   #+BEGIN_SRC python :tangle no
     import modules.parameters as c
     jv = c.juncture_voltage()
     t1 = jv.value == 0.1
     t2 = jv.validate(1.1) == False
     jv.update(2)
     t3 = jv.value == 0.1
     jv.update(0.2)
     t4 = jv.value == 0.2
     t5 = jv.validate(-1.1) == False
     jv.update(5)
     t6 = jv.value == 0.2
     jv.update(0.22)
     t7 = jv.value == 0.22
     jv.reset()
     t8 = jv.value == 0.1
     t9 = jv.name == "Juncture Voltage"
     return [t1, t2, t3, t4, t5, t6, t7, t8, t9]
   #+END_SRC

    #+RESULTS:
****** DONE Piezo Speed Breaking
   The piezo speed breaking defined in [[src-config-piezo-brk-class]] is the parameter that controls the speed at which each measurement cycle is executed, defined in \([V/s]\). The Piezo speed class is just a specialization of the Numerical parameter class described in [[Numerical Parameters definition]].

   #+CAPTION: <<src-config-piezo-brk-class>> : Piezo speed breaking class definition
   #+name: src-config-piezo-brk-class
   #+BEGIN_SRC python -n -r
     #############################################################
     ## @class   piezo_break
     #  @brief   All functionality related to the
     #           piezo_speed_breaking
     #
     #  @details This class defines the behavior of the piezo
     #           speed voltage relations which is defined in [V/s]
     #           Provides the default values and range plus the
     #           corresponding interfaces.
     #############################################################
     class break_speed(numerical_parameter):
         #############################################################
         ## @brief   Initilaization code
         #############################################################
         def __init__(self):
             _dflt = 300.0
             _min = 10.0
             _max = 600.0
             _name = "Piezo Speed Breaking"
             super(break_speed, self).__init__(_name, _dflt, _min, _max)
   #+END_SRC
******* DONE Piezo brk test                                        :noexport:
   Test functionality. Just executed by using =C-c C-c=. Should all be true
   #+BEGIN_SRC python :tangle no
     import modules.parameters as c
     ps = c.break_speed()
     t1 = (ps.value == 300.0) & (ps.fixed_speed == 300.0)
     t2 = ps.validate(331.1) == False
     ps.update(334.2)
     t3 = (ps.value == 300.0) & (ps.fixed_speed == 300.0)
     ps.update(45.2)
     t4 = (ps.value == 45.2) & (ps.fixed_speed == 300.0)
     t5 = ps.validate(2.1) == False
     ps.update(700)
     t6 = (ps.value == 45.2) & (ps.fixed_speed == 300.0)
     ps.update(90)
     t7 = (ps.value == 90) & (ps.fixed_speed == 300.0)
     ps.reset()
     t8 = (ps.value == 300) & (ps.fixed_speed == 300.0)
     ps.update(-90)
     t9 = (ps.value == 300) & (ps.fixed_speed == 300.0)
     return [t1, t2, t3, t4, t5, t6, t7, t8, t9]
   #+END_SRC

   #+RESULTS:
   | True | True | True | True | True | True | True | True | True |
****** DONE Piezo Speed Making
   The piezo speed making defined in [[src-config-piezo-mk-class]] is the parameter that controls the speed at which each measurement cycle is executed, defined in \([V/s]\). The Piezo speed class is just a specialization of the Numerical parameter class described in [[Numerical Parameters definition]].

   #+CAPTION: <<src-config-piezo-mk-class>> : Piezo speed breaking class definition
   #+name: src-config-piezo-mk-class
   #+BEGIN_SRC python -n -r
     #############################################################
     ## @class   piezo_make
     #  @brief   All functionality related to the
     #           piezo_speed_making
     #
     #  @details This class defines the behavior of the piezo
     #           speed voltage relations which is defined in [V/s]
     #           Provides the default values and range plus the
     #           corresponding interfaces.
     #############################################################
     class make_speed(numerical_parameter):
         #############################################################
         ## @brief   Initilaization code
         #############################################################
         def __init__(self):
             _dflt = 500.0
             _min = 30.0
             _max = 800.0
             _name = "Piezo Speed Making"
             super(make_speed, self).__init__(_name, _dflt, _min, _max)
   #+END_SRC
******* DONE Piezo make test                                       :noexport:
   Test functionality. Just executed by using =C-c C-c=. Should all be true
   #+BEGIN_SRC python :tangle no
     import modules.parameters as c
     ps = c.make_speed()
     t1 = (ps.value == 300.0) & (ps.fixed_speed == 300.0)
     t2 = ps.validate(531.1) == False
     ps.update(334.2)
     t3 = (ps.value == 300.0) & (ps.fixed_speed == 300.0)
     ps.update(45.2)
     t4 = (ps.value == 45.2) & (ps.fixed_speed == 300.0)
     t5 = ps.validate(2.1) == False
     ps.update(700)
     t6 = (ps.value == 45.2) & (ps.fixed_speed == 300.0)
     ps.update(90)
     t7 = (ps.value == 90) & (ps.fixed_speed == 300.0)
     ps.reset()
     t8 = (ps.value == 300) & (ps.fixed_speed == 300.0)
     ps.update(-90)
     t9 = (ps.value == 300) & (ps.fixed_speed == 300.0)
     return [t1, t2, t3, t4, t5, t6, t7, t8, t9]
   #+END_SRC

   #+RESULTS:
   | True | True | True | True | True | True | True | True | True |
****** DONE Number of traces
   The number of traces defined in [[src-config-traces-class]] is the parameter that controls the number of measurement cycles excecuted using the piezoelectric actuator, where a trace is a full cycle going from closed to open and back. The traces class is a simple specialization of the Integer parameter class described in [[Numerical Parameters definition]] ([[src-config-int-param-class]]).

   #+CAPTION: Number of traces class definition
   #+NAME: src-config-traces-class
   #+BEGIN_SRC python -n -r
     #############################################################
     ## @class   traces
     #  @brief   All functionality related to the number of traces
     #
     #  @details This class defines the parameter that controls
     #           the number of traces (runs) performed using the
     #           piezo. Each trace correspond to a full cycle
     #           from closed juncture to open and back.
     #############################################################
     class traces(integer_parameter):
         #############################################################
         ## @brief   Initilaization code
         #############################################################
         def __init__(self):
             _dflt = int(5000)
             _min = int(1)
             _max = int(20000)
             _name = "Number of Traces"
             super(traces, self).__init__(_name, _dflt, _min, _max)
   #+END_SRC
******* DONE number traces test                                    :noexport:
   #+BEGIN_SRC python :tangle no
     import modules.parameters as c
     tr = c.traces()
     t1 = tr.value == 5000
     t2 = tr.validate(40000) == False
     tr.update(5.2)
     t3 = tr.value == 5000
     tr.update(200)
     t4 = tr.value == 200
     t5 = tr.validate(-100) == False
     tr.update(120000)
     t6 = tr.value == 200
     tr.update(8000)
     t7 = tr.value == 8000
     tr.reset()
     t8 = tr.value == 5000
     return [t1, t2, t3, t4, t5, t6, t7, t8]
   #+END_SRC

   #+RESULTS:
****** DONE Display xmin
   To display the measurements on real time, we show the histogram, and we define the minimum value for the *X-axis*, since we plot in *distance* value, we define the minimun as:

   #+CAPTION: display xmin class definition
   #+name: src-config-xmin-class
   #+BEGIN_SRC python  -n -r
     #############################################################
     ## @class   display_xmin
     #  @brief   All functionality related to the minimum of X axis
     #
     #  @details This class defines the behavior of the minimum
     #           for the X axis. Provides the default values and range
     #           plus the corresponding interface.
     #############################################################
     class display_xmin(numerical_parameter):
         #############################################################
         ## @brief   Initilaization code
         #############################################################
         def __init__(self):
             _dflt = -0.5
             _min = -0.9
             _max = -0.1
             _name = "display_xmin"
             super(display_xmin, self).__init__(_name, _dflt, _min, _max)
   #+END_SRC
****** DONE Display xmax
   To display the measurements on real time, we show the histogram, and we define the maximum value for the *X-axis*, since we plot in *distance* value, we define the minimun as:

   #+CAPTION: Display xmax class definition
   #+name: src-config-xmax-class
   #+BEGIN_SRC python  -n -r
     #############################################################
     ## @class   display_xmax
     #  @brief   All functionality related to the maximum of X axis
     #
     #  @details This class defines the behavior of the maximum
     #           for the X axis. Provides the default values and range
     #           plus the corresponding interface.
     #############################################################
     class display_xmax(numerical_parameter):
         #############################################################
         ## @brief   Initilaization code
         #############################################################
         def __init__(self):
             _dflt = 2
             _min = 0.9
             _max = 3.9
             _name = "display_xmax"
             super(display_xmax, self).__init__(_name, _dflt, _min, _max)
   #+END_SRC
****** DONE Display Gmin
   To display the measurements on real time, we show the histogram, and we define the minimum value for the *Y-axis*, since we plot in *conductance* value, we define the minimun as:

   #+CAPTION: Display Gmin class definition
   #+name: src-config-gmin-class
   #+BEGIN_SRC python  -n -r
     #############################################################
     ## @class   display_Gmin
     #  @brief   All functionality related to the minimum of Y axis
     #
     #  @details This class defines the behavior of the minimum
     #           for the Y axis. Provides the default values and range
     #           plus the corresponding interface.
     #############################################################
     class display_Gmin(numerical_parameter):
         #############################################################
         ## @brief   Initilaization code
         #############################################################
         def __init__(self):
             _dflt = 1e-7
             _min = 1e-9
             _max = 1e-6
             _name = "display_Gmin"
             super(display_Gmin, self).__init__(_name, _dflt, _min, _max)
   #+END_SRC
****** DONE Display Gmax
   To display the measurements on real time, we show the histogram, and we define the maximum value for the *Y-axis*, since we plot in *Conductance* value, we define the maximum as:

   #+CAPTION: Display Gmax class definition
   #+name: src-config-gmax-class
   #+BEGIN_SRC python  -n -r
     #############################################################
     ## @class   display_xmax
     #  @brief   All functionality related to the maximum of Y axis
     #
     #  @details This class defines the behavior of the maximum
     #           for the X axis. Provides the default values and range
     #           plus the corresponding interface.
     #############################################################
     class display_Gmax(numerical_parameter):
         #############################################################
         ## @brief   Initilaization code
         #############################################################
         def __init__(self):
             _dflt = 10
             _min = 1
             _max = 100
             _name = "display_Gmax"
             super(display_Gmax, self).__init__(_name, _dflt, _min, _max)
   #+END_SRC

