Measure_samples.org
** TODO Adwin driver-IV measurement class
The Adwin IV measurement class provides a single interface, which controls the process to perform continuous measurements of the current/voltage characteristics of the sample, while providing a high level interface to interact with the instrument. To define the class we need
- Parameters :: Defined in [[Adwin driver-IV parameters]]. These parameters define the indices required to interact with the internal program.
- Driver class :: Defined in  [[Adwin IV-measurement driver]]. This is the class definition which provides with the necessary interface to interact with the instrument.

*** DONE Adwin driver-IV parameters
The Adwin instrument, stores its internal variables in predefined variables, which can be queried through an external program such as the driver defined in  [[Adwin IV-measurement driver]].  These variables are classified as:

- Int variables :: Defined in [[Adwin driver-IV int parameter]]. These correspond to integer variables.
- Float variables :: Defined in [[Adwin driver-IV int parameter]]. These correspond to  float variables.
- Array variables ::  Defined in [[Adwin driver-IV int parameter]]. These correspond to array variables.

The variables are identified with an index according to the instrument documentation. We also need to define the process number used by the ADwin program for the IV measurements.

#+CAPTION: Top level view of the Adwin parameters and related constants. For details see the corresponding sections
#+name: src-adwin-parameters
#+BEGIN_SRC python
  class ADW_IV_CONST(object):
      PROCESS_NUMBER = 1
      <<src-adwin-iv-param>>
      <<src-adwin-iv-fparam>>
      <<src-adwin-iv-aparam>>
#+END_SRC

**** DONE Adwin driver-IV int parameters
The Int parameters are used to define the indices to the corresponding integer variables in the internal ADwin memory used for communication. The variables used are:
- START_JV :: Used for setting the initial juncture voltage (off). The value should be set to an equivalent of \(0[V]\)
- MEASURE_JV ::  Used for setting the Juncture voltage set during measurements
- END_JV :: Used for setting the juncture voltage at end of measurements, like the starting voltage should be set to \(0[V]\)
- WAIT   :: Used for setting  the number of cycles to wait before measuring the current, after reaching the desired juncture voltage
- MAX_DATA :: Used for setting the maximum number of data points to measure. After reaching the target value, the measurements should stop
- ABORT ::  Used ad the parameter used to  abort measurements early
- END_STATUS :: Parameter used to communicate that measurements have ended.

#+CAPTION: <<src-adwin-iv-param>> Adwin parameter indices used for communicating the int variables with the instrument for IV parameter measurements
#+NAME: src-adwin-iv-param
#+BEGIN_SRC python :tangle no
  ###########################################################################
  ## @brief  Indices  for int vars in ADwin used for IV measurements
  ###########################################################################
  # Inputs for the ADWIN IV measurement
  START_JV    = 1
  MEASURE_JV  = 2
  END_JV      = 3
  WAIT        = 7
  AVG         = 8
  MAX_DATA    = 10
  ABORT       = 11
  # outputs for the ADWIN IV measurement
  END_STATUS  = 12
#+END_SRC
**** DONE Adwin driver-IV float parameters
The float parameters are used to define the indices to the corresponding float variables in the internal ADwin memory used for communication. The variables used are:
- I_CH1      :: Float variable used to store the current measured in channel 1
- I_CH1_AMPL :: Float variable used to store the current measured in channel 1 with log amplifier
- I_CH2      :: Float variable used to store the current measured in channel 1
- I_CH2_AMPL :: Float variable used to store the current measured in channel 1 with log amplifier

#+CAPTION: <<src-adwin-iv-fparam>> Adwin parameter indices used for communicating the float variables with the instrument for IV parameter measurements
#+NAME: src-adwin-iv-fparam
#+BEGIN_SRC python :tangle no
  ###########################################################################
  ## @brief  Indices  for float vars in ADwin used for IV measurements.
  ###########################################################################
  # output variables for measured currents for the ADWIN IV measurement
  I_CH1       = 1
  I_CH1_AMPL  = 2
  I_CH2       = 3
  I_CH2_AMPL  = 4
#+END_SRC
**** DONE Adwin driver-IV array parameters
The array  parameters are used to define the indices to the corresponding array variables in the internal ADwin memory used for communication. The variables used in this process are:
- LOG_AMP ::  Used to provide  the logarithmic amplifier calibration array

#+CAPTION: <<src-adwin-iv-aparam>> Adwin parameter indices used for communicating the array variables with the instrument for IV parameter measurements
#+NAME: src-adwin-iv-aparam
#+BEGIN_SRC python :tangle no
  ###########################################################################
  ## @brief  Indices  for array vars in ADwin used for IV measurements
  ###########################################################################
  # ----------------------------- inputs  ------------------------------
  LOG_AMPL  = 10
#+END_SRC

*** TODO Adwin IV-measurement driver
This driver provides the functionality required to perform the measurements using the IV-measurement process, which is to perform continuous measures and provide an interface to query the current state (See [[Adwin Measure IV process]]). This process is designed to be used in conjunction with the Faulhaber part of the process (See [[Faulhaber driver]]).

As usual with this type of definitions, the code is split in logical blocks; in this case:
- Initialization code :: The code required to initialize the class and instantiate it as a user. See [[Adwin IV driver-Initialization Code]]
- API :: Or the functions that a user should use in order to query the information from the instrument. See [[Adwin IV driver-interface functions]]

**** TODO Adwin IV driver-Initialization Code
Code fragment [[adwin-driver-iv-interface]] shows the initialization code for the IV-measurements, in which some specializations are used over the base class in the =__init__=, where the function =configure_process= shown in line [[(adw-iv-configure)]] , which ensures that every parameter and variable needed for performing the measurements is correctly initialized
#+Caption: <<adwin-driver-iv-interface>> Code fragment with the base definition for the iv measurements
#+name: src-adwin-driver-iv-interface
#+BEGIN_SRC python
  ############################################################
  ## @class   adwin_iv_driver
  #  @details This class initializes the driver with the
  #           the purpose of performing continuos IV
  #           measurements.
  #           The class provides the interfaces to extract
  #           the data as necesary
  ############################################################
  class adwin_iv_driver(adwin_driver):
      #############################################################
      ## @brief   Initilaization code
      #############################################################
      def __init__(self, config):
          process_number = ADW_IV_CONST.PROCESS_NUMBER
          filename = "iv_measurement_process.T9{0}".format(process_number)
          super(adwin_iv_driver, self).__init__(process_number, filename)
          self.config = config
          self.load_process()
          self.configure_process()
      #############################################################
      ## @brief   Set all parameters to start measuring
      #############################################################
      def configure_process(self): #  (ref:adw-iv-configure)
          c = self.config
          log_array = c.get_log_array()
          length = len(log_array)
          self.adw.Set_Processdelay(ADW_IV_CONST.PROCESS_NUMBER,
                                    param.ADW_GCONST.PROCESS_DELAY )
          self.adw.Set_Par(ADW_IV_CONST.START_JV, c.get_start_jv())
          self.adw.Set_Par(ADW_IV_CONST.MEASURE_JV, c.get_measure_jv())
          self.adw.Set_Par(ADW_IV_CONST.END_JV, c.get_end_jv())
          self.adw.Set_Par(ADW_IV_CONST.WAIT, c.get_wait_cycles())
          self.adw.Set_Par(ADW_IV_CONST.AVG, c.get_avg_points())
          self.adw.Set_Par(ADW_IV_CONST.MAX_DATA, c.get_max_data())
          self.adw.SetData_Float(log_array,
                                ADW_IV_CONST.LOG_AMPL, 1, length)
      <<src-adwin-iv-driver-api>>
#+END_SRC

**** TODO Adwin IV driver-interface functions
     :PROPERTIES:
     :header-args+: :tangle no
     :END:
This section provides with the functions required to obtain the measurements from the instrument. The main functionality is to obtain the conductance measurement, as a fraction of the "1 Gold atom conductance" usually noted as *G0*
#+name: src-adwin-iv-driver-api
#+BEGIN_SRC python :tangle no
  #############################################################
  ## @brief   Return the current measured by the ADwin
  #############################################################
  def get_current(self):
      if self.config.get_use_log_amp():
          current = self.adw.Get_FPar(ADW_IV_CONST.I_CH1_AMPL)
      else:
          digital_current = self.adw.Get_FPar(ADW_IV_CONST.I_CH1)
          current = adwin_DAC(digital_current) /self.config.linear_gain
      return current
  #############################################################
  ## @brief   Return the conductance measured by the ADwin
  #############################################################
  def get_real_conductance(self):
      return self.get_current()/self.config.get_real_jv()
  #############################################################
  ## @brief   Return the conductance as a "G0" factor measured
  #############################################################
  def get_conductance(self):
      return self.get_real_conductance()/param.GLOBAL_CONSTANTS.G0
#+END_SRC

*** Adwin IV testing                                               :noexport:
#+BEGIN_SRC python :tangle test_adwin_iv.py
  from time import strftime
  import numpy as np
  import pylab as pl
  import matplotlib.pyplot as plt
  from modules.adwin_driver import *
  from modules.configuration import *


  # Configure Plot
  infile = "Measurement_deafult_config.yaml"
  outfile = "Measurement_read_config.yaml"
  config = yaml_build_config_from_file(infile)
  dconfig = config.display_config
  hconfig = config.hist_config
  iv_config = config.iv_config


  adw = adwin_iv_driver(iv_config)
  adw.start_process()
  for i in range(100):
      print(adw.get_conductance())
#+END_SRC

** TODO Adwin driver-histogram class
*** DONE Adwin driver-histogram parameters
In a similar way as shown in [[Adwin driver-IV parameters]] the parameters are grouped in 3 categories

- Int variables :: shown in code fragment [[src-adwin-hist-param]] These correspond to the indices for the integer variables.
- Float variables :: shown in code fragment [[src-adwin-hist-fparam]] These correspond to the indices for the float variables.
- Array variables :: shown in code fragment [[src-adwin-hist-aparam]] These correspond to the indices for the array variables.

#+BEGIN_SRC python
  class ADW_HIST_CONST(object):
      PROCESS_NUMBER = 2
      <<src-adwin-hist-param>>
      <<src-adwin-hist-fparam>>
      <<src-adwin-hist-aparam>>
#+END_SRC
**** DONE Adwin driver-histogram int parameters
The Int parameters are used to define the indices to the corresponding integer variables in the internal ADwin memory used for communication. The variables used are:
- START_JV :: Used for setting the initial juncture voltage (off). The value should be set to an equivalent of \(0[V]\)
- MEASURE_JV ::  Used for setting the Juncture voltage set during measurements
- END_JV :: Used for setting the juncture voltage at end of measurements, like the starting voltage should be set to \(0[V]\)
- BREAK_WAIT   :: Used for setting  the number of cycles to wait before measuring the current, after modifying the piezoelectric voltage during the breaking analysis, and in turn the position of the piezoelectric. This time is considered as a stabilization time, to avoid measuring before the piezoelectric is stable in its new position
- MAKE_WAIT   :: Used for setting  the number of cycles to wait before measuring the current, after modifying the piezoelectric voltage during the make histogram analysis. As with the *BREAK_WAIT* this is considered a stabilization time.
- AVG :: Used as the index to set the number of measurements to be performed before taking an average in each piezoelectric point.
- PROCESS_STATUS :: Used as output, to check the current status of the histogram measurement process
- END_STATUS :: Flag used to communicate the python program that the measurement process is ended
- ERROR_STATUS :: Used as flag to let the python program know that there was an error in the measurement and the data should not be stored
- BREAK_IDX  ::  Used as the variable where the length of the array of break-histogram is stored and read by the program .
- MAKE_IDX  ::  Used as the variable where the length of the array of break-histogram is stored and read by the program .

#+CAPTION: <<src-adwin-hist-param>> Adwin parameter indices used for communicating the int variables with the instrument for the histogram measurements
#+NAME: src-adwin-hist-param
#+BEGIN_SRC python :tangle no
  ###########################################################################
  ## @brief  Indices  for int vars with ADwin for IV measurements
  ###########################################################################
  # Inputs for the ADWIN histogram measurement
  START_JV    = 1
  MEASURE_JV  = 2
  END_JV      = 3
  BREAK_WAIT  = 17
  MAKE_WAIT   = 18
  AVG         = 19
  # outputs for the ADWIN histogram measurement
  PROCESS_STATUS  = 12
  END_STATUS  = 13
  ERROR_STATUS  = 14
  BREAK_IDX   = 20
  MAKE_IDX    = 21
#+END_SRC

**** DONE Adwin driver-histogram float parameters
The float parameters are used to define the indices to the corresponding float variables in the internal ADwin memory used for communication. The variables used are:
- I_MIN_BRK  :: Variable used to set the minimum expected current during breaking
- I_MAX_MK   :: Variable used to set the maximum expected current during making

#+CAPTION: <<src-adwin-hist-fparam>> Adwin parameter indices used for communicating the float variables with the instrument for the histogram measurements
#+NAME: src-adwin-hist-fparam
#+BEGIN_SRC python :tangle no
  ###########################################################################
  ## @brief  Indices  for float vars with ADwin for IV measurements
  ###########################################################################
  # inputs for the ADWIN histogram measurement
  I_MIN_BRK  = 10
  I_MAX_MK   = 11
#+END_SRC

